app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description") VALUES (?, ?)  [["title", "bsfgbfbfddf"], ["description", "fbdbfbrbrsfaagagg"]]
---
      def create
        @article = Article.new(article_params)
        if @article.save

UPDATE "articles" SET "description" = ? WHERE "articles"."id" = ?  [["description", "fggrgrgrtgdasfaffwfef4vzdfb"], ["id", 4]]
---
      def update
        if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 8]]
---
      def destroy
        @article.destroy